/* Теоретичні питання
1. Що таке логічний оператор?
   Логічні оператори в JS - це спеціальні символи або ключові слова, які використовуються для 
   виконання логічних операцій над значеннями. Ці операції пов'язані з булевими типами даних 
   (true або false). 
   

2. Які логічні оператори є в JavaScript і які їх символи?
   Основні логічні оператори в JS:

   Логічний AND (&&):
   Використовується для перевірки, чи обидва операнди є true.
   Приклад: if (a && b) { // виконується, якщо як a, так і b є true }

   Логічний OR (||):
   Використовується для перевірки, чи хоча б один із операндів є true.
   Приклад: if (a || b) { // виконується, якщо або a, або b є true }

   Логічний NOT (!):
   Використовується для інверсії значення операнду (з true на false і навпаки).
   Приклад: if (!a) { // виконується, якщо a є false }
   
Практичні завдання.
1. Попросіть користувача ввести свій вік за допомогою prompt.
Якщо вік менше 12 років, виведіть у вікні alert повідомлення про те,
що він є дитиною, якщо вік менше 18 років, виведіть повідомлення про те,
що він є підлітком, інакше виведіть повідомлення про те, що він є дорослим.
Завдання з підвищенною складністю.
Перевірте чи ввів користувач саме число в поле prompt. Якщо ні, то виведіть повідомлення, 
що введено не число.
2. Напишіть програму, яка запитує у користувача місяць року (українською мовою маленкими літерами) 
та виводить повідомлення, скільки днів у цьому місяці. Результат виводиться в консоль.
Скільки днів в кожному місяці можна знайти тут в розділі Юліанський і Григоріанський календарі 
- https://uk.wikipedia.org/wiki/%D0%9C%D1%96%D1%81%D1%8F%D1%86%D1%8C_(%D1%87%D0%B0%D1%81)
(Використайте switch case) */

"use strict";

console.log('____task#1____');

const userAge = prompt('How old are you?');

if (userAge && !isNaN(userAge)) {
    if (userAge < 12) {
        alert('You are a kid');
    } else if (userAge < 18) {
        alert('You are a teenager');
    } else {
        alert('You are an adult');
    }
} else {
    alert('Error! You didn\'t enter a number!')
}

console.log('____task#2____');

const monthYear = prompt('Напишить любий місяц українською мовою');

switch (monthYear.toLowerCase()) {
    case 'січень': {
        console.log(`${monthYear} містить 31 день`);
        alert (`${monthYear} містить 31 день`);
        break;
    }

    case 'лютий': {
        console.log(`${monthYear} містить 28 днів! або 29 - якщо це вісокосний рік!`);
        alert (`${monthYear} містить 28 днів! або 29 - якщо це вісокосний рік!`);
        break;
    }

    case 'березень': {
        console.log(`${monthYear} містить 31 день!`);
        alert (`${monthYear} містить 31 день!`);
        break;
    }

    case 'квітень': {
        console.log(`${monthYear} містить 30 днів!`);
        alert (`${monthYear} містить 30 днів!`);
        break;
    }

    case 'травень': {
        console.log(`${monthYear} містить 31 день!`);
        alert (`${monthYear} містить 31 день!`);
        break;
    }

    case 'червень': {
        console.log(`${monthYear} містить 30 днів!`);
        alert (`${monthYear} містить 30 днів!`);
        break;
    }

    case 'липень': {
        console.log(`${monthYear} містить 31 день!`);
        alert (`${monthYear} містить 31 день!`);
        break;
    }

    case 'серпень': {
        console.log(`${monthYear} містить 31 день!`);
        alert (`${monthYear} містить 31 день!`);
        break;
    }

    case 'вересень': {
        console.log(`${monthYear} містить 30 днів!`);
        alert (`${monthYear} містить 30 днів!`);
        break;
    }

    case 'жовтень': {
        console.log(`${monthYear} містить 31 день!`);
        alert (`${monthYear} містить 31 день!`);
        break;
    }

    case 'листопад': {
        console.log(`${monthYear} містить 30 днів!`);
        alert (`${monthYear} містить 30 днів!`);
        break;
    }

    case 'грудень': {
        console.log(`${monthYear} містить 31 день!`);
        alert (`${monthYear} містить 31 день!`);
        break;
    }

    default: {
        console.log('Інформація не зрозуміла, треба було ввести любий місяц года українською мовою');
        alert ('Інформація не зрозуміла, треба було ввести любий місяц года українською мовою');
    }
}